# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки 
# были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

from random import randint

coin = int(input('Введите количество монет: '))
reshka, eagle = 0, 0

for _ in range(coin):
    side_of_the_coin = randint(0, 1)
    print(side_of_the_coin, end = ' ')
    if side_of_the_coin == 1:
        reshka += 1
    else:
        eagle += 1
if reshka > eagle:
    print(f'\nПереверните монетки с орлом в количестве {eagle} штук.')
elif reshka == eagle:
    print('\nРешек и орлов одинаковое количество! Можете перевернуть любые монетки с одинаковым значением.')
else:
    print(f'\nПереверните монетки с решкой в количестве {reshka} штук.')



